Revit 2026 API

# ICustomFieldProperties Interface

---

Represents the base class for the properties of a custom field.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface ICustomFieldProperties
```
```vb
Public Interface ICustomFieldProperties
```
```cpp
public interface class ICustomFieldProperties
```
```fsharp
type ICustomFieldProperties = interface end
```

The ICustomFieldProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreEqualTo | Identifies if the custom field properties are equal or not. |

#### Reference

Autodesk.Revit.DB Namespace